carter-thaxton/oresat-firmware/src/m3/CC1310_Simplex/tirtos_builds_CC1310_LAUNCHXL_release_gcc/Debug/configPkg/package/cfg/release_pm3g.c
    dl = & __sysbios_data_other_load__;
    ds = & __sysbios_data_other_start__;
    de = & __sysbios_data_other_end__;

    while (ds < de) {
        *ds = *dl;
        dl++;
        ds++;
    }
}

#define REVISION_WORD 0x1001ca94

Void ti_sysbios_rom_cortexm_cc13xx_CC13xx_badRomRevision__E() {
	/* Loop here forever if application is built with wrong version of ROM image */
        while(1) {
            ;
        }
}

Void ti_sysbios_rom_cortexm_cc13xx_CC13xx_checkRevision__E()
{
    if (*((UInt32 *)(REVISION_WORD)) != 0x20394770) {
	ti_sysbios_rom_cortexm_cc13xx_CC13xx_badRomRevision__E();
    }
}


/*
 * ======== ti.sysbios.rts.gnu.ReentSupport TEMPLATE ========
 */



/*
 * ======== ti.posix.tirtos.Settings TEMPLATE ========
 */

/*  Fabricate external function declarations to avoid including
 *  the POSIX header files, because they require -std=c99 compile
 *  option. This option is new with GCC v7. We don't want to force
 *  users to add this option when compiling this file (big.c).
 *
 *  Nota Bene: The ti.sysbios.hal.Seconds module injects time.h into
 *  big.c. When building with package.bld (e.g. benchloop), this will
 *  find TI-POSIX time.h which declares clock_gettime() and timer_delete().
 *  However, when building the kernel (i.e. SDK build flow), time.h is
 *  found in GNU target libs install, in which case these functions are
 *  not declared. The condition below handles these cases.
 */

#include <time.h>

#ifndef ti_posix_gcc_time__include
extern int clock_gettime(clockid_t, struct timespec *);
extern int timer_delete(timer_t);
#endif

extern void mq_close(void);
extern void pthread_attr_destroy(void);
extern void pthread_barrierattr_init(void);
extern void pthread_condattr_init(void);
extern void pthread_key_delete(void);
extern void pthread_mutexattr_destroy(void);
extern void pthread_rwlockattr_destroy(void);
extern void sched_yield(void);
extern void sem_destroy(void);
extern void sleep(void);

/*
 *  ======== ti_sysbios_posix_dummyFxn ========
 *  This function will ensure that posix functions will be linked in
 *  if they are used. It calls one function from each posix source file.
 *  This function should never be called.
 */
void ti_sysbios_posix_dummyFxn(void)
{
    /* call one function from each posix source file */
    clock_gettime((clockid_t)0, NULL);  /* clock.c */
    mq_close();                         /* mqueue.c */
    pthread_attr_destroy();             /* pthread.c */
    pthread_barrierattr_init();         /* pthread_barrier.c */
    pthread_condattr_init();            /* pthread_cond.c */
    pthread_key_delete();               /* pthread_key.c */
    pthread_mutexattr_destroy();        /* pthread_mutex.c */
    pthread_rwlockattr_destroy();       /* pthread_rwlock.c */
    sched_yield();                      /* sched.c */
    sem_destroy();                      /* semaphore.c */
    sleep();                            /* sleep.c */
    timer_delete((timer_t)NULL);        /* timer.c */
}

/*
 * ======== ti.sysbios.rts.MemAlloc TEMPLATE ========
 */



#if defined(__ti__)

#pragma FUNC_EXT_CALLED(malloc);
#pragma FUNC_EXT_CALLED(memalign);
#pragma FUNC_EXT_CALLED(free);
#pragma FUNC_EXT_CALLED(calloc);
#pragma FUNC_EXT_CALLED(realloc);

#define ATTRIBUTE

#elif defined(__IAR_SYSTEMS_ICC__)

#define ATTRIBUTE

#else

#define ATTRIBUTE __attribute__ ((used))

#endif


#include <xdc/std.h>

#include <xdc/runtime/Memory.h>
#include <xdc/runtime/Error.h>

#include <string.h>

#if defined(__GNUC__) && !defined(__ti__)

#include <reent.h>

#endif

/*
 * Header is a union to make sure that the size is a power of 2.
 *
 * On the MSP430 small model (MSP430X), size_t is 2 bytes, which makes
 * the size of this struct 6 bytes.
 */
typedef union Header {
    struct {
        Ptr   actualBuf;
        SizeT size;
    } header;
    UArg pad[2];	/* 4 words on 28L, 8 bytes on most others */
} Header;

/*
 *  ======== ti_sysbios_rts_gnu_MemAlloc_alloc ========
 */
static Void *ti_sysbios_rts_gnu_MemAlloc_alloc(SizeT size)
{
    Header *packet;
    xdc_runtime_Error_Block eb;

    xdc_runtime_Error_init(&eb);

    if (size == 0) {
        return (NULL);
    }

    packet = (Header *)xdc_runtime_Memory_alloc(NULL,
        (SizeT)(size + sizeof(Header)), 0, &eb);

    if (packet == NULL) {
        return (NULL);
    }

    packet->header.actualBuf = (Ptr)packet;
    packet->header.size = size + sizeof(Header);

    return (packet + 1);
}

/*
 *  ======== malloc ========
 */
Void ATTRIBUTE *malloc(SizeT size)
{
    return (ti_sysbios_rts_gnu_MemAlloc_alloc(size));
}

/*
 *  ======== memalign ========
 *  mirrors the memalign() function from the TI run-time library
 */
Void ATTRIBUTE *memalign(SizeT alignment, SizeT size)
{
    Header                      *packet;
    Void                        *tmp;
    xdc_runtime_Error_Block     eb;

    xdc_runtime_Error_init(&eb);

    if (alignment < sizeof(Header)) {
        alignment = sizeof(Header);
    }

    /*
     * return NULL if size is 0, or alignment is not a power of 2
     */
    if (size == 0 || (alignment & (alignment - 1))) {
        return (NULL);
    }

    /*
     * Allocate 'align + size' so that we have room for the 'packet'
     * and can return an aligned buffer.
     */
    tmp = xdc_runtime_Memory_alloc(NULL, alignment + size, alignment, &eb);

    if (tmp == NULL) {
        return (NULL);
    }

    packet = (Header *)((char *)tmp + alignment - sizeof(Header));

    packet->header.actualBuf = tmp;
    packet->header.size = size + sizeof(Header);

    return (packet + 1);
}

/*
 *  ======== calloc ========
 */
Void ATTRIBUTE *calloc(SizeT nmemb, SizeT size)
{
    SizeT       nbytes;
    Ptr         retval;

    nbytes = nmemb * size;

    /* return NULL if there's an overflow */
    if (nmemb && size != (nbytes / nmemb)) {
        return (NULL);
    }

    retval = ti_sysbios_rts_gnu_MemAlloc_alloc(nbytes);
    if (retval != NULL) {
        (Void)memset(retval, (Int)'\0', nbytes);
    }

    return (retval);
}

